cask_args appdir: '/Applications'

# tap
tap "azure/functions"
tap "clementtsang/bottom"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mistertea/et"

# brew
brew "openssl@1.1"
brew "bat"
brew "carthage"
brew "gcc"
brew "clang-format"
brew "exa"
brew "fd"
# brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "gifsicle"
brew "git"
brew "fzf"
brew "ghq"
brew "gradle"
brew "htop"
# brew "libusbmuxd", args: ["HEAD"]
# brew "libimobiledevice", args: ["HEAD"]
# brew "ios-webkit-debug-proxy", args: ["HEAD"]
brew "iperf3"
brew "ipython"
brew "jenv"
brew "jq"
brew "node"
brew "jupyterlab"
brew "kubectx"
brew "kubernetes-cli"
brew "lastpass-cli"
brew "mitmproxy"
brew "mosh"
# brew "mysql-client"
# brew "mysql@5.7", restart_service: true
brew "neovim"
brew "ngrep"
brew "openjdk"
brew "pyqt"
brew "vtk"
brew "opencv"
brew "openjdk@11"
brew "peco"
brew "postgresql"
brew "procs"
brew "python@3.9"
brew "redis", restart_service: true
brew "ripgrep"
brew "speedtest-cli"
brew "starship"
brew "tmux"
brew "tokei"
brew "vim"
brew "watch"
brew "wget"
# brew "winetricks"
brew "wireguard-tools"
brew "yamllint"
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "azure/functions/azure-functions-core-tools@3"
brew "clementtsang/bottom/bottom"
brew "mistertea/et/et"

# cask
cask "1password"
cask "1password-cli"
cask "alfred"
cask "betterzip"
cask "corretto8"
cask "devdocs"
cask "font-hack-nerd-font"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-roboto-mono-nerd-font"
cask "iterm2"
cask "openvpn-connect"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "suspicious-package"
cask "tableplus"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "webpquicklook"
