cask_args appdir: '/Applications'

# tap
# tap "azure/functions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mistertea/et"

# brew
brew "openssl@1.1"
brew "bat"
brew "bottom"
brew "carthage"
brew "gcc"
brew "clang-format"
brew "exa"
brew "fd"
# brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "gifsicle"
brew "git"
brew "fzf"
brew "ghq"
brew "gpg"
# brew "gradle"
brew "htop"
# brew "libusbmuxd", args: ["HEAD"]
# brew "libimobiledevice", args: ["HEAD"]
# brew "ios-webkit-debug-proxy", args: ["HEAD"]
brew "iperf3"
# brew "ipython"
brew "jenv"
brew "jq"
brew "node"
# brew "jupyterlab"
brew "kubectx"
brew "kubernetes-cli"
# brew "lastpass-cli"
brew "mas"
brew "mitmproxy"
brew "mosh"
# brew "mysql-client"
# brew "mysql@5.7", restart_service: true
brew "neovim"
brew "ngrep"
brew "openjdk"
# brew "pyqt"
brew "vtk"
brew "opencv"
brew "openjdk@11"
brew "peco"
brew "php"
brew "postgresql"
brew "procs"
brew "python@3.10"
brew "redis", restart_service: true
brew "ripgrep"
brew "ruby@2.6"
brew "speedtest-cli"
brew "starship"
brew "terminal-notifier"
brew "tmux"
brew "tokei"
brew "vim"
brew "volta"
brew "watch"
brew "wget"
# brew "winetricks"
brew "wireguard-tools"
brew "yamllint"
brew "yarn"
brew "youtube-dl"
brew "zlib"
brew "zsh"
brew "zsh-completions"
# brew "azure/functions/azure-functions-core-tools@3"
brew "mistertea/et/et"

# cask
cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "alfred"
cask "bartender"
cask "bettertouchtool"
cask "betterzip"
cask "cheatsheet"
cask "chromedriver"
cask "chromedriver-beta"
cask "corretto8"
cask "devdocs"
cask "discord"
cask "docker"
cask "dropbox"
cask "dropzone" 
cask "font-hack-nerd-font"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-roboto-mono-nerd-font"
cask "google-chrome"
cask "google-drive"
cask "hot"
cask "iterm2"
cask "istat-menus"
cask "luna-display"
cask "microsoft-office"
cask "openvpn-connect"
cask "philips-hue-sync"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
# cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "spotify"
cask "suspicious-package"
cask "tableplus"
# cask "virtualbox"
# cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "webpquicklook"
